# SolarHeatGainCoefficient Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyThermalProperties..::..SolarHeatGainCoefficient Property
FamilyThermalProperties Class See Also
---
The solar heat gain coefficient.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double SolarHeatGainCoefficient { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SolarHeatGainCoefficient As Double
	Get
```

Visual C++
---
```text
public:
property double SolarHeatGainCoefficient {
	double get ();
}
```

# See Also
FamilyThermalProperties Class
Autodesk.Revit.DB Namespace